       FD  SOLD-BY.
       01  SOLDBY-REC.
           03  SB-KEY.
               05  SB-TYPE               PIC XX.
               05  SB-INVOICE-NUMBER     PIC 9(6).
           03  SB-TRANS                  PIC 9.
           03  SB-ACCOUNT-NUMBER         PIC 9(7).
           03  SB-ACCOUNT-NAME           PIC X(25).
           03  SB-DATE-OF-INVOICE        PIC 9(8).
           03  SB-SALE-AMOUNT            PIC 9(7)V99.
           03  SB-COST-AMOUNT            PIC 9(7)V99.
      *