       FD  STDISC-MASTER.
       01  STDISC-RECORD.
           03  STDISC-KEY.
               05  STDISC-STOCKNUMBER    PIC X(15).
               05  STDISC-ACCOUNT        PIC 9(7).
           03  STDISC-PERCENT            PIC 9(2)V99.
           03  STDISC-DATE               PIC 9(8).
      *