       FD  PULL-BY.
       01  PULLBY-REC.
           03  PB-KEY.
               05  PB-INITIAL            PIC XX.
               05  PB-INVOICE            PIC 9(6).
           03  PB-LINE-CNT               PIC 9(3).
           03  PB-INV-DATE               PIC 9(8).
           03  PB-SALE-AMOUNT            PIC 9(7)V99.
      *
