      *
       Check-Data-Name-Position Section.
       CDNN-010.
           If Sub-4 = 1
            Move Alpha-Rate to Ws-Debtor.
           If Sub-4 = 2
            Move Alpha-Rate to Ws-DrTrans.
           If Sub-4 = 3
            Move Alpha-Rate to Ws-DrContact.
           If Sub-4 = 4
            Move Alpha-Rate to Ws-DrMail.
           If Sub-4 = 5
            Move Alpha-Rate to Ws-DrDeliver.
           If Sub-4 = 6
            Move Alpha-Rate to Ws-Stock.
           If Sub-4 = 7
            Move Alpha-Rate to Ws-StTrans.
           If Sub-4 = 8
            Move Alpha-Rate to Ws-StReceipt.
           If Sub-4 = 9
            Move Alpha-Rate to Ws-StReceiptLy.
           If Sub-4 = 10
            Move Alpha-Rate to Ws-StImports.
           If Sub-4 = 11
            Move Alpha-Rate to Ws-StOrders.
           If Sub-4 = 12
            Move Alpha-Rate to Ws-StSpecPr.
           If Sub-4 = 13
            Move Alpha-Rate to Ws-StOrderGen.
           If Sub-4 = 14
            Move Alpha-Rate to Ws-StNewPrice.
           If Sub-4 = 15
            Move Alpha-Rate to Ws-StChange.
           If Sub-4 = 16
            Move Alpha-Rate to Ws-DailyEx.
           If Sub-4 = 17
            Move Alpha-Rate to Ws-InvRev.
           If Sub-4 = 18
            Move Alpha-Rate to Ws-Parameter.
           If Sub-4 = 19
            Move Alpha-Rate to Ws-SoldBy.
           If Sub-4 = 20
            Move Alpha-Rate to Ws-SbRep.
           If Sub-4 = 21
            Move Alpha-Rate to Ws-Sales.
           If Sub-4 = 22
            Move Alpha-Rate to Ws-Distribution.
           If Sub-4 = 23
            Move Alpha-Rate to Ws-Register.
           If Sub-4 = 24
            Move Alpha-Rate to Ws-SlSpecials.
           If Sub-4 = 25
            Move Alpha-Rate to Ws-CrMaster.
           If Sub-4 = 26
            Move Alpha-Rate to Ws-CrTrans.
           If Sub-4 = 27
            Move Alpha-Rate to Ws-CrJrn.
           If Sub-4 = 28
            Move Alpha-Rate to Ws-CrCurrency.
           If Sub-4 = 29
            Move Alpha-Rate to Ws-CbMaster.
           If Sub-4 = 30
            Move Alpha-Rate to Ws-CbMasterLy.
           If Sub-4 = 31
            Move Alpha-Rate to Ws-CbTrans.
           If Sub-4 = 32
            Move Alpha-Rate to Ws-CbTransLy.
           If Sub-4 = 33
            Move Alpha-Rate to Ws-GlMaster.
           If Sub-4 = 34
            Move Alpha-Rate to Ws-GlMasterLy.
           If Sub-4 = 35
            Move Alpha-Rate to Ws-GlTrans.
           If Sub-4 = 36
            Move Alpha-Rate to Ws-GlTransLy.
           If Sub-4 = 37
            Move Alpha-Rate to Ws-GlJrn.
           If Sub-4 = 38
            Move Alpha-Rate to Ws-GlParameter.
           If Sub-4 = 39
            Move Alpha-Rate to Ws-Toolkit.
           If Sub-4 = 40
            Move Alpha-Rate to Ws-CoCompany.
           If Sub-4 = 41
            Move Alpha-Rate to Ws-Menu.
           If Sub-4 = 42
            Move Alpha-Rate to Ws-Data.
           If Sub-4 = 43
            Move Alpha-Rate to Ws-CoFormsLib.
           If Sub-4 = 44
            Move Alpha-Rate to Ws-CoFaxParam.
           If Sub-4 = 45
            Move Alpha-Rate to Ws-CoPullBy.
           If Sub-4 = 46
            Move Alpha-Rate to Ws-CoCashSale.
           If Sub-4 = 47
            Move Alpha-Rate to Ws-CoPull.
           If Sub-4 = 48
            Move Alpha-Rate to Ws-CoPrinters.
           If Sub-4 = 49
            Move Alpha-Rate to Ws-StCatalogue.
           If Sub-4 = 50
            Move Alpha-Rate to Ws-StAlternative.
           If Sub-4 = 51
            Move Alpha-Rate to Ws-CrFBCHeader.
           If Sub-4 = 52
            Move Alpha-Rate to Ws-CrFBCTrans.
           If Sub-4 = 53
            Move Alpha-Rate to Ws-CrAlias.
           If Sub-4 = 54
            Move Alpha-Rate to Ws-CrCheques.
           If Sub-4 = 55
            Move Alpha-Rate to Ws-StDiscAcc.
           If Sub-4 = 56
            Move Alpha-Rate to Ws-CoStaffInOut.
           If Sub-4 = 57
            Move Alpha-Rate to Ws-StBranchCat.
           If Sub-4 = 58
            Move Alpha-Rate to Ws-StTransLy.
           If Sub-4 = 59
            Move Alpha-Rate to Ws-SlRegLy.
           If Sub-4 = 60
            Move Alpha-Rate to Ws-Cams-Data.
           If Sub-4 = 61
            Move Alpha-Rate to Ws-BankCams.
           If Sub-4 = 62
            Move Alpha-Rate to Ws-CrRemit.
           If Sub-4 = 63
            Move Alpha-Rate to Ws-CrRemitTrans.
           If Sub-4 = 64
            Move Alpha-Rate to Ws-DebtorOld.
           If Sub-4 = 65
            Move Alpha-Rate to Ws-StockLookup.
           If Sub-4 = 66
            Move Alpha-Rate to Ws-CrMasterOld.
           If Sub-4 = 67
            Move Alpha-Rate to Ws-CoPrintersRemote.
           If Sub-4 = 68
            Move Alpha-Rate to Ws-StTransTemp.
           If Sub-4 = 69
            Move Alpha-Rate to Ws-SlRegTemp.
           If Sub-4 = 70
            Move Alpha-Rate to Ws-OfisData.
           If Sub-4 = 71
            Move Alpha-Rate to Ws-CrTransTemp.
           If Sub-4 = 72
            Move Alpha-Rate to Ws-CrJrnTemp.
           If Sub-4 = 73
            Move Alpha-Rate to Ws-DrTransTemp.
           If Sub-4 = 74
            Move Alpha-Rate to Ws-DebtorTemp.
           If Sub-4 = 75
            Move Alpha-Rate to Ws-GlTransTemp.
           If Sub-4 = 76
            Move Alpha-Rate to Ws-SlQuoteBatch.
           If Sub-4 = 77
            Move Alpha-Rate to Ws-StOrdersTemp.
       CDNN-999.
           Exit.
