      *
       ERROR4-MESSAGE SECTION.
       ERROR4-000.
             PERFORM CENTRE-MESSAGE-INFO.
             
             MOVE 2901 TO POS.
             DISPLAY "                                      " AT POS.
             DISPLAY WS-MESSAGE AT 2901 WITH REVERSE-VIDEO
      *       DISPLAY WS-MESSAGE AT 2901 WITH reverse-video BLINK
                BELL FOREGROUND-COLOR IS 4.
       ERROR4-010.
             CALL "LOCKKBD" USING F-FIELDNAME.
       ERROR4-020.
             MOVE 2901 TO POS
             MOVE " " TO WS-MESSAGE
             DISPLAY WS-MESSAGE AT POS.
       ERROR4-999.
             EXIT.
      *
