       CONTROL-100.
           MOVE "CoPrinter"     TO WS-PRINTPROG.
           CALL WS-PRINTPROG USING WS-LINKAGE.
           CANCEL WS-PRINTPROG.
           IF WS-PRINTERSELECTED = 99
             MOVE
           "THERE IS A PRINTER SELECTION PROBLEM, 'ESC' TO EXIT."
             TO WS-MESSAGE
             PERFORM ERROR-MESSAGE
             EXIT PROGRAM.
           MOVE WS-PRINTERNAME (21)  TO WS-PRINTER.
           MOVE WS-PRINTERCHARS (21) TO WS-PRINT-CHARS.
           MOVE WS-PRINT-BOLD        TO COMP-DIG1
           MOVE WS-PRINT-UNBOLD      TO COMP-DIG2.
           
           MOVE WS-PRINTER TO WS-PRINTER-SAVE WS-MESSAGE.
      *     PERFORM ERROR-MESSAGE.
